In [1]:
# Pandas works on Series and DataFrame
# Series -> Single Column  -> 1D
# DataFrame -> TabularFormat -> Table-Format  ->  2D

In [2]:
import pandas as pd
import numpy as np

In [3]:
data = {
    'EMP_ID':[101,102,103,104,105,106,107],
    'EMP_NAME':['Rahul','Suresh','Mahesh','Ramesh','Umesh','Ram','Rohan'],
    'EMP_SAL':[23450,56330,35640,24320,36430,45640,34530]
}

In [4]:
data

{'EMP_ID': [101, 102, 103, 104, 105, 106, 107],
 'EMP_NAME': ['Rahul', 'Suresh', 'Mahesh', 'Ramesh', 'Umesh', 'Ram', 'Rohan'],
 'EMP_SAL': [23450, 56330, 35640, 24320, 36430, 45640, 34530]}

In [5]:
df = pd.DataFrame(data)

In [6]:
df

   EMP_ID EMP_NAME  EMP_SAL
0     101    Rahul    23450
1     102   Suresh    56330
2     103   Mahesh    35640
3     104   Ramesh    24320
4     105    Umesh    36430
5     106      Ram    45640
6     107    Rohan    34530

In [7]:
df.head()

   EMP_ID EMP_NAME  EMP_SAL
0     101    Rahul    23450
1     102   Suresh    56330
2     103   Mahesh    35640
3     104   Ramesh    24320
4     105    Umesh    36430

In [8]:
df.tail()

   EMP_ID EMP_NAME  EMP_SAL
2     103   Mahesh    35640
3     104   Ramesh    24320
4     105    Umesh    36430
5     106      Ram    45640
6     107    Rohan    34530

In [9]:
df.head(3)

   EMP_ID EMP_NAME  EMP_SAL
0     101    Rahul    23450
1     102   Suresh    56330
2     103   Mahesh    35640

In [10]:
df.tail(2)

   EMP_ID EMP_NAME  EMP_SAL
5     106      Ram    45640
6     107    Rohan    34530

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   EMP_ID    7 non-null      int64
 1   EMP_NAME  7 non-null      object
 2   EMP_SAL   7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes

In [12]:
df.describe()

           EMP_ID     EMP_SAL
count    7.000000      7.0000
mean   104.000000  36620.0000
std      2.160247  11546.6301
min    101.000000  23450.0000
25%    102.500000  29425.0000
50%    104.000000  35640.0000
75%    105.500000  41035.0000
max    107.000000  56330.0000

In [13]:
data = {
    'EMP_ID':[101,102,103,104,105,106,107],
    'EMP_NAME':['Rahul',np.nan,'Mahesh','Ramesh','Umesh','Ram','Rohan'],
    'EMP_SAL':[23450,56330,35640,np.nan,36430,np.nan,34530]
}

In [14]:
df = pd.DataFrame(data)

In [15]:
df

   EMP_ID EMP_NAME  EMP_SAL
0     101    Rahul  23450.0
1     102      NaN  56330.0
2     103   Mahesh  35640.0
3     104   Ramesh      NaN
4     105    Umesh  36430.0
5     106      Ram      NaN
6     107    Rohan  34530.0

In [16]:
# Check Null Values
df.isnull()

   EMP_ID  EMP_NAME  EMP_SAL
0   False     False    False
1   False      True    False
2   False     False    False
3   False     False     True
4   False     False    False
5   False     False     True
6   False     False    False

In [17]:
# Null Values by Columns
df.isnull().sum()

EMP_ID      0
EMP_NAME    1
EMP_SAL     2
dtype: int64

In [18]:
# Total Null Values in Entire Dataset
df.isnull().sum().sum()

3

In [19]:
# CHecking Dataset Shape
df.shape

(7, 3)

In [20]:
print("Rows -",df.shape[0])
print("Columns -",df.shape[1])

Rows - 7
Columns - 3

In [21]:
# Total Number of Values in Dataset
df.shape[0]*df.shape[1]

21

In [22]:
# Percentage of missing values in Dataset
# 3/21*100
df.isnull().sum().sum()/(df.shape[0]*df.shape[1])*100

14.285714285714285

In [23]:
# We can observe we can not do any transformation with a missing value columns
df['EMP_ID']*df['EMP_SAL']

0    2368450.0
1    5745660.0
2    3670920.0
3          NaN
4    3825150.0
5          NaN
6    3694710.0
dtype: float64

In [24]:
# Removing Missing Values
df = df.dropna()

In [25]:
df

   EMP_ID EMP_NAME  EMP_SAL
0     101    Rahul  23450.0
2     103   Mahesh  35640.0
4     105    Umesh  36430.0
6     107    Rohan  34530.0

In [26]:
# Now Shape of Dataset
print("Rows - ",df.shape[0],"Columns - ",df.shape[1])
print("Total Values - ",df.shape[0]*df.shape[1])

Rows -  4 Columns -  3
Total Values -  12

In [27]:
# Now We loss Data percentage is
(21-12)/21*100

42.857142857142854

# If we are lossing a big percentage of dataset then, we should not use dropna.

<h3>We can use dropna if we are lossing only 0 to 0.5% data.</h3>

In [28]:
data = {
    'EMP_ID':[101,102,103,104,105,106,107],
    'EMP_NAME':['Rahul',np.nan,'Mahesh','Ramesh','Umesh','Ram','Rohan'],
    'EMP_SAL':[23450,56330,35640,np.nan,36430,np.nan,34530]
}

In [60]:
df = pd.DataFrame(data)

In [30]:
df

   EMP_ID EMP_NAME  EMP_SAL
0     101    Rahul  23450.0
1     102      NaN  56330.0
2     103   Mahesh  35640.0
3     104   Ramesh      NaN
4     105    Umesh  36430.0
5     106      Ram      NaN
6     107    Rohan  34530.0

In [31]:
# We need to fill missing/null Values in Dataset using fillna
df = df.fillna(value="MISSING")

In [32]:
df

   EMP_ID EMP_NAME  EMP_SAL
0     101    Rahul  23450.0
1     102  MISSING  56330.0
2     103   Mahesh  35640.0
3     104   Ramesh  MISSING
4     105    Umesh  36430.0
5     106      Ram  MISSING
6     107    Rohan  34530.0

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   EMP_ID    7 non-null      int64
 1   EMP_NAME  7 non-null      object
 2   EMP_SAL   7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [34]:
# We can see we lose our salary column format
# So We can not Calculate the sum and average etc

In [35]:
df

   EMP_ID EMP_NAME  EMP_SAL
0     101    Rahul  23450.0
1     102  MISSING  56330.0
2     103   Mahesh  35640.0
3     104   Ramesh  MISSING
4     105    Umesh  36430.0
5     106      Ram  MISSING
6     107    Rohan  34530.0

In [36]:
# We also can not do like this.
df.fillna(value=10000)

   EMP_ID EMP_NAME  EMP_SAL
0     101    Rahul  23450.0
1     102  MISSING  56330.0
2     103   Mahesh  35640.0
3     104   Ramesh  MISSING
4     105    Umesh  36430.0
5     106      Ram  MISSING
6     107    Rohan  34530.0

In [37]:
# We are going to fill values column by column
df.columns

Index(['EMP_ID', 'EMP_NAME', 'EMP_SAL'], dtype='object')

In [38]:
df.isnull().sum()

EMP_ID      0
EMP_NAME    0
EMP_SAL     0
dtype: int64

In [45]:
df['EMP_NAME'] = df['EMP_NAME'].fillna(value="Missing")
df['EMP_SAL'] = df['EMP_SAL'].fillna(value=10000)

In [46]:
df

   EMP_ID EMP_NAME  EMP_SAL
0     101    Rahul  23450.0
1     102  Missing  56330.0
2     103   Mahesh  35640.0
3     104   Ramesh  10000.0
4     105    Umesh  36430.0
5     106      Ram  10000.0
6     107    Rohan  34530.0

In [47]:
# This is the Average salary of an Employee With New DataSet
df['EMP_SAL'].mean()

29482.85714285714

In [49]:
df

   EMP_ID EMP_NAME  EMP_SAL
0     101    Rahul  23450.0
1     102      NaN  56330.0
2     103   Mahesh  35640.0
3     104   Ramesh      NaN
4     105    Umesh  36430.0
5     106      Ram      NaN
6     107    Rohan  34530.0

In [50]:
# Average Salary of An Employee With Old Dataset
df['EMP_SAL'].mean()

37276.0

In [51]:
# That Mean You Should not fill any value directly

In [52]:
# We should use mean mode values to fill data

In [53]:
# mode -> Most Repeated Value -> (works with object/string)
# mean -> Average Value -> (works with number column (int/float))

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   EMP_ID    7 non-null      int64
 1   EMP_NAME  6 non-null      object
 2   EMP_SAL   5 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 300.0+ bytes

In [55]:
# We are going to fill null values with mode and mean value
# for object Column
df['EMP_NAME'] = df['EMP_NAME'].fillna(value=df['EMP_NAME'].mode()[0])
df['EMP_SAL'] = df['EMP_SAL'].fillna(value=df['EMP_SAL'].mean())

In [56]:
df

   EMP_ID EMP_NAME  EMP_SAL
0     101    Rahul  23450.0
1     102   Mahesh  56330.0
2     103   Mahesh  35640.0
3     104   Ramesh  37276.0
4     105    Umesh  36430.0
5     106      Ram  37276.0
6     107    Rohan  34530.0

In [57]:
df['EMP_SAL'].mean()

37276.0

In [58]:
# ------------------------------------------

In [61]:
df

   EMP_ID EMP_NAME  EMP_SAL
0     101    Rahul  23450.0
1     102      NaN  56330.0
2     103   Mahesh  35640.0
3     104   Ramesh      NaN
4     105    Umesh  36430.0
5     106      Ram      NaN
6     107    Rohan  34530.0

In [62]:
# We are going to fill null values with forward filling, backward_filling

In [63]:
df.fillna(method="ffill")

C:\Users\THIS\AppData\Local\Temp\ipykernel_14444\3944122520.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

   EMP_ID EMP_NAME  EMP_SAL
0     101    Rahul  23450.0
1     102    Rahul  56330.0
2     103   Mahesh  35640.0
3     104   Ramesh  35640.0
4     105    Umesh  36430.0
5     106      Ram  36430.0
6     107    Rohan  34530.0

In [64]:
df.fillna(method="bfill")

C:\Users\THIS\AppData\Local\Temp\ipykernel_14444\3896554658.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="bfill")

   EMP_ID EMP_NAME  EMP_SAL
0     101    Rahul  23450.0
1     102   Mahesh  56330.0
2     103   Mahesh  35640.0
3     104   Ramesh  36430.0
4     105    Umesh  36430.0
5     106      Ram  34530.0
6     107    Rohan  34530.0

In [65]:
df.ffill()

   EMP_ID EMP_NAME  EMP_SAL
0     101    Rahul  23450.0
1     102    Rahul  56330.0
2     103   Mahesh  35640.0
3     104   Ramesh  35640.0
4     105    Umesh  36430.0
5     106      Ram  36430.0
6     107    Rohan  34530.0

In [66]:
df.bfill()

   EMP_ID EMP_NAME  EMP_SAL
0     101    Rahul  23450.0
1     102   Mahesh  56330.0
2     103   Mahesh  35640.0
3     104   Ramesh  36430.0
4     105    Umesh  36430.0
5     106      Ram  34530.0
6     107    Rohan  34530.0

In [67]:
df = df.ffill()

In [68]:
df

   EMP_ID EMP_NAME  EMP_SAL
0     101    Rahul  23450.0
1     102    Rahul  56330.0
2     103   Mahesh  35640.0
3     104   Ramesh  35640.0
4     105    Umesh  36430.0
5     106      Ram  36430.0
6     107    Rohan  34530.0

In [69]:
df['EMP_SAL'].mean()

36921.42857142857